app/views/trips/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "trips_users" ON "users"."id" = "trips_users"."user_id" WHERE "trips_users"."trip_id" = $1  [["trip_id", 1]]
---
            <div class="ui four column doubling stackable grid container">
                <% @trip.users.all.each do |user| %>

SELECT  1 AS one FROM "users" INNER JOIN "trips_users" ON "users"."id" = "trips_users"."user_id" WHERE "trips_users"."trip_id" = $1 AND "users"."id" = $2 LIMIT $3  [["trip_id", 1], ["id", 1], ["LIMIT", 1]]
---
    </div>
    <% if @trip.users.include?(current_user) %>

SELECT "posts".* FROM "posts" WHERE "posts"."trip_id" = $1  [["trip_id", 3]]
SELECT  1 AS one FROM "posts" WHERE "posts"."trip_id" = $1 LIMIT $2  [["trip_id", 1], ["LIMIT", 1]]
---
                                <% end %>
                                    <% if @trip.posts.any? %>
                                        <% @trip.posts.reverse.each do |post| %>

SELECT "items".* FROM "items" WHERE "items"."trip_id" = $1  [["trip_id", 1]]
---
            <ul class="ui large middle animated aligned divided list">
                <% @trip.items.reverse.each do |item| %>