app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 1]]
---
    def index
      @bookings = current_user.bookings.includes(:room).paginate(page: params[:page], per_page: 10)

INSERT INTO "bookings" ("room_type", "user_id", "room_id", "start_date", "last_date", "created_at", "updated_at", "num_of_user") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      @booking = current_user.bookings.build(booking_params)
      respond_to do |format|
        if @booking.save

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 AND "bookings"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
      def set_booking
        debugger
        @booking = current_user.bookings.find_by_id(params[:id])