app/models/trip.rb

    def find_author
        author = User.find_by(id: self.author_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def self.by_category
        Trip.all.sort_by {|trip| trip.category.name}
---
SELECT "trips".* FROM "trips"

    def self.by_most_recent
        t = Trip.by_date
        t.first(5)
---
SELECT  "trips".* FROM "trips" ORDER BY "trips"."date" ASC LIMIT $1  [["LIMIT", 5]]

    def self.by_location
        Trip.all.sort_by {|trip| trip.location.state}
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips"

    def self.by_specific_name name
        Trip.all.select{|trip| trip.name.downcase.include? name}
---
SELECT "trips".* FROM "trips"

    def self.by_specific_user username
        trips = []
        users = User.all.select{|user| user.name.downcase.include?(username)}
        users.each do |user|
            if Trip.all.select{|trip| trip.users.include?(user)} == []
            else
            trips << Trip.all.select{|trip| trip.users.include?(user)}
---
SELECT "users".* FROM "users"
SELECT  1 AS one FROM "users" INNER JOIN "trips_users" ON "users"."id" = "trips_users"."user_id" WHERE "trips_users"."trip_id" = $1 AND "users"."id" = $2 LIMIT $3  [["trip_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT "trips".* FROM "trips"